{
    "mintaka": "\nQuestion: When did aerosmith form?\nWikipedia Answer: 1970\nWikidata Answer: 1969\nInternal Knowledge: 1970\nContext: Aerosmith is an American rock band that has sold more than 150 million records worldwide. According to the Wikipedia Article, Aerosmith was formed in the year 1970 in Boston. While the Wikidata answer is 1969, which could be the ‘inception’ and the ‘work period (start)’ is 1970. Wikipedia might be more reliable given the context and 1970 is the final answer \nAnswer: 1970\n\nQuestion: Who played Gandalf in Lord of the rings?\nWikipedia Answer: Ian McKellen\nWikidata Answer: Ian McKellen\nInternal Knowledge: Ian McKellen\nContext:  According to the Wikipedia page of Gandalf states that he is a central character in the novels The Hobbit and The Lord of the Rings. In the movie, The Lord of the Rings film series, Ian McKellen played the character Gandalf.. The same answer can be verified with the Wikidata entity page The Lord of the Rings (film series).\nAnswer:  Ian McKellen\n\nQuestion: What basketball team is from Indiana?\nWikipedia Answer: Indiana Pacers\nWikidata Answer: None\nInternal Knowledge: Indiana Pacers\nContext:  National Basketball Association is a professional basketball league in North America composed of 30 teams. From the Indiana Wikipedia page, Indiana is a state in the U.S with its capital being Indianapolis, home to professional sports team, including NBA’s Indiana Pacers. Wikidata does not provide an answer. Hhowever, using the Wikipedia article as context, Indiana Pacers is the final answer.\nAnswer:  Indiana Pacers\n\nQuestion: What is the oldest continuously inhabited city in the world?\nWikipedia Answer: None\nWikidata Answer: None\nInternal Knowledge: Damascus\nContext:  According to the wikipedia pages of List of oldest continuously inhabited cities, nor through querying over Wikidata no information could be extracted to find the oldest inhabited city in the world. However, the Internal knowledge states, Damascus is often cited as the oldest continuously inhabited city in the world, it has evidence of habitation that dates back to at least 4,000 BC. Therefore, Damascus is the final answer.\nAnswer:  Damascus \n\nQuestion: What is the tallest mountain in alaska?\nWikipedia Answer: Denali\nWikidata Answer: Mount Stevens (Alaska)\nInternal Knowledge: Denali\nContext: The  Wikipedia Article of “Alaska Range” which is a mountain range states that Denali is the tallest mountain in North America., Iit is located in Alaska range. While the Wikidata gives the answer as Mount Stevens, this could be less reliable as the Wikidata Entity of this Mountain altitude may be in Feet while Denali altitude might be in Metres. Therefore, Wikipedia is more reliable in this case and Denali is the tallest mountain in Alaska\nAnswer:  Denali\n",
    "qald": "\nQuestion: How large is the area of uk?\nWikipedia Answer: 93,628 square miles (242,495 km2)\nWikidata Answer: 242495\nInternal Knowledge: 242,495 square kilometres\nContext: According to the Wikipedia article, the area of the United Kingdom is 93,628 square miles (242,495 km2). However the Wikidata gives the 242495 with no specific units, but it can be inferred from the Wikipedia answer that 242495 is km2 and 242,495 km2 is the final answer.\nAnswer: 242495 \n\nQuestion: What is the location of the houses of parliament?\nWikipedia Answer: City of Westminster, central London, England.\nWikidata Answer: City of Westminster\nInternal Knowledge: Palace of Westminster\nContext: The Wikipedia article, Palace of Westminster,  informally known as the Houses of Parliament,  is the meeting place for both the House of Commons and the House of Lords in the United Kingdom. It is located in the City of Westminster, central London, England. The Wikidata entity page of the Palace of Westminster also confirms the same. Therefore, the City of Westminster is the final answer.\nAnswer: City of Westminster\n\nQuestion: How many grand-children did Jacques Cousteau have?\nWikipedia Answer: None\nWikidata Answer: None\nInternal Knowledge: 4\nContext: Jacques-Yves Cousteau is a french novel officer, filmmaker and author, also, co-invented the Aqua-Lung, which assisted him in producing some of the first underwater documentaries. His Wikipedia page nor his Entity page in Wikidata mentions the number of grand-children Jacques Cousteau have. But Internal Knowledge which is the only source of answer in this case, that he had 4 grandchildren\nAnswer: 4\n\n\nQuestion: How much is the population of mexico city ?\nWikipedia Answer: 9,209,944\nWikidata Answer: 9209944\nInternal Knowledge: 9,000,000\nContext: The Wikipedia page of Mexico city states that the 2020 population of the city is 9,209,944. Generally in these cases, Wikidata answers are more reliable, but since Wikipedia and Wikidata answers are consistent, the final answer is 9209944.\nAnswer: 9209944\n\nQuestion: Who is the current federal minister of finance in germany?\nWikipedia Answer: Christian Lindner\nWikidata Answer: Christian Lindner\nInternal Knowledge: Olaf Scholz\nContext: According to both the Wikipedia Article and Wikidata Entity page of the Federal Ministry of Finance (Germany), the current Federal minister of Finance in Germany is Christian Lindner.\nAnswer: Christian Lindner\n\nQuestion: How many awards has Bertrand Russell?\nWikipedia answer : 5\nWikidata answer : 7\nInternal Knowledge: Bertrand Russell received numerous awards throughout his life, including the Nobel Prize in Literature in 1950.\nContext: According to Wikipedia Bertrand Russel won five awards - the Nobel Prize in Literature, the De Morgan Medal, the Sylvester Medal, the Kalinga Prize, and the Jerusalem Prize. According to Wikidata, he won 7 awards, which might be more accurate, therefore the final answer is 7.\nAnswer: 7\n",
    "compmix": "\nQuestion: How many seasons of the Emily in Paris  series?\nWikipedia answer : 3\nWikidata answer : 3 \nInternal Knowledge: 1\nContext: According to the Wikipedia page for the “Emily in Paris” TV series, there were 3 seasons that debuted so far. This information is confirmed in Wikidata. The third season premiered on December 21, 2022. It has been renewed for a fourth season as well. Therefore, there are 3 seasons of Emily in Paris series..\nAnswer: 3\n\nQuestion: In what year did soccer become part of the olympics?\nWikipedia answer : 1996\nWikidata answer : None \nInternal Knowledge: 1900 \nContext: Football at the Summer Olympics Wikipedia page states that, except 1896 and 1932, every other year Football has been included in every Summer Olympic Games as men’s competitor. Women’s football was added to the official program in 1996. Therefore, 1990 might be the correct answer since the  article suggests that football was played before 1932 while also after 1896 in olympics. \nAnswer: 1900\n\nQuestion: What is the original language of the movie lord of the rings?\nWikipedia answer : None\nWikidata answer : English \nInternal Knowledge: English\nContext: Wikipedia couldn't provide the answer to the question. Wikidata provided the answer as English is the original language of the film series The Lord of the Rings (film series). This can be verified from the entity page of The Lord of the Rings (film series). \nAnswer: English\n\nQuestion: Who was the creator of sherlock holmes?\nWikipedia answer : Arthur Conan Doyle\nWikidata answer : Arthur Conan Doyle \nInternal Knowledge: Arthur Conan Doyle\nContext: Sherlock Holmes is a fictional detective created by British author Arthur Conan Doyle. The character first appeared in 1887 and is known for his proficiency with observation, deduction, forensic science, and logical reasoning. This can be verified from both the Wikipedia page and entity page of Sherlock Holmes on Wikidata.\nAnswer: Arthur Conan Doyle\n\nQuestion: What is the genre of book A Tale of Two Cities?\nWikipedia answer : Historical Novel\nWikidata answer : Historical Fiction \nInternal Knowledge:  Historical Fiction\nContext: Historical Novel and Historical Fiction are generally used interchangeably. According to the Wikipedia Page of “A Tale of Two Cities”, it is a historical novel published in 1859 by Charles Dickens. Though the given answers from Wikipedia and Wikidata are very similar, Wikidata might be more reliable and therefore the final answer is that the genre of “A Tale of Two Cities” is Historical Fiction.\nAnswer:  Historical Fiction\n\nQuestion: Godzilla vs. kong came out in which year?\nWikipedia answer : 2021\nWikidata answer : 31st March 2021\nInternal Knowledge:  2021\nContext: According to Wikipedia, Godzilla vs. Kong is a 2021 American monster film directed by Adam Wingard. The Wikidata entity page of Godzilla vs Kong  mentions the publication date in the US is 31st March 2021.\nAnswer:  31st March 2021\n\nQuestion: When was the author of mirrorshades born?\nWikipedia answer : April 14, 1954\nWikidata answer : 1954-04-14\nInternal Knowledge:  1954\nContext:The Wikipedia page, Mirrorshades: The Cyberpunk Anthology (1986) is a cyberpunk short story collection, authored by American writer Bruce Sterling and his Wikipedia page confirms that he was born on April 14, 1954. The same information can be verified on entity page of Bruce Sterling\nAnswer:  1954-04-14\n"
}